In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [2]:
df1 = DataFrame({'key':['x','y','z'],'data_set_1':[1,2,3]})

In [3]:
df1

  key  data_set_1
0   x           1
1   y           2
2   z           3

In [4]:
df2 = DataFrame({'key':['A','B','C'],'data_set_2':[4,5,6]})

In [5]:
df2

  key  data_set_2
0   A           4
1   B           5
2   C           6

In [6]:
pd.merge(df1,df2)

Empty DataFrame
Columns: [key, data_set_1, data_set_2]
Index: []

In [10]:
df2 = DataFrame({'key':['x','B','C'],'data_set_2':[4,5,6]})

In [12]:
df2

  key  data_set_2
0   x           4
1   B           5
2   C           6

In [14]:
df1

  key  data_set_1
0   x           1
1   y           2
2   z           3

In [15]:
pd.merge(df1,df2)

  key  data_set_1  data_set_2
0   x           1           4

In [16]:
df1 = DataFrame({'key':['x','y','z','x'],'data_set_1':[1,2,3,4]})

In [17]:
df1

  key  data_set_1
0   x           1
1   y           2
2   z           3
3   x           4

In [18]:
df2

  key  data_set_2
0   x           4
1   B           5
2   C           6

In [19]:
pd.merge(df1,df2)

  key  data_set_1  data_set_2
0   x           1           4
1   x           4           4

In [20]:
pd.merge(df1,df2,on=None)

  key  data_set_1  data_set_2
0   x           1           4
1   x           4           4

In [21]:
pd.merge(df1,df2,on='key')

  key  data_set_1  data_set_2
0   x           1           4
1   x           4           4

In [23]:
pd.merge(df1,df2,on='key',how='inner')

  key  data_set_1  data_set_2
0   x           1           4
1   x           4           4

In [24]:
pd.merge(df1,df2,on='key',how='left')

  key  data_set_1  data_set_2
0   x           1         4.0
1   y           2         NaN
2   z           3         NaN
3   x           4         4.0

In [25]:
pd.merge(df1,df2,on='key',how='right')

  key  data_set_1  data_set_2
0   x         1.0           4
1   x         4.0           4
2   B         NaN           5
3   C         NaN           6

In [26]:
pd.merge(df1,df2,on='key',how='outer')

  key  data_set_1  data_set_2
0   x         1.0         4.0
1   x         4.0         4.0
2   y         2.0         NaN
3   z         3.0         NaN
4   B         NaN         5.0
5   C         NaN         6.0